# Introduction to SQL/2

### Cartesian Product

- Find the Cartesian product instructor X teaches
    ```sql
    select *
    from instructor, teaches
    ```
    - generates every possible instructor-teaches pair, with all attributes from both relations
    - For common attributes (for example, ID), the attributes in the resulting table are renamed using the relation name (for example, instructor.ID)
- Cartesian product not very useful directly, but useful combined with where-clause condition (selection operation in relational algebra)

### Rename ***AS***  Operation

- The SQL allows renaming relations and attributes using the ***as*** clause:
    ```sql
    old_name as new_name
    ```
- Find the names of all instructors who have a higher salary than some instructor in 'Comp. Sci'.
    ```sql
    select distinct T.name
    from instructor as T, instructor as S,
    where T.salary > S.salary and S.dept_name = 'Comp. Sci'
    ```
- Keyword ***as*** is optional and may be omitted

instructor ***as*** T = instructor T

## String Operation
- SQL includes a string-matching operator for comparisons on character strings. The operator ***like*** uses patterns that are described using two special characters:
    - percent (%). The % character matches any substring
    - underscore (-). The character matches any character 
- Find the names of all instructors whose name includes the substring "dar"
    ```sql
    select name
    from instructor
    where name like '%dar%'
- Match the string "100%"
    ***like*** '100%' ***escape*** '\'
- in that above we use backslash (\) as the escape character
- Patterns are case sensitive
- Pattern matching examples:
    - 'Intro%' matches any string beginning with "Intro"
    - '%Comp%' matches any string containing "Comp" as a substring
    - '' matches any string of exactly three characters
    - '%' matches any string of at least three characters
- SQL supports a variety of string operations such as
    - concatenation (using "||")
    - converting from upper to lower case (and vice versa)
    - finding string length, extracting substrings, etc.

## Ordering the Display of Tuples
- List in alphabetic order the names of all instructors
    ```sql
    select distinct name
    from instructor
    order by name
- We may specify desc for descending order or asc for ascending order, for each attribute; ascending order is the default.
    - Example: order by name desc
- Can sort on multiple attributes
    - Example: order by dept_name, name

## Selecting Number of Tuples in Output
- The **Select Top** clause is used to specify the number of records to return
- The **Select Top** clause is useful on large tables with thousands of records. Returning a large number of records can impact performance
    ```sql
    select top 10 distinct name
    from instructor
- Not all database systems support the SELECT TOP clause.
    - SQL Server & MS Access support select top
    - MySQL supports the limit clause
    - Oracle uses fetch first n rows only and rownum
    ```sql
    select distinct name
    from instructor
    order by name
    fetch first 10 rows only

## Where Clause Predicates

SQL includes a **`BETWEEN`** comparison operator.

### Example:
Find the names of all instructors with salary between $90,000 and $100,000 (that is, ≥ $90,000 and ≤ $100,000):

```sql
SELECT name
FROM instructor
WHERE salary BETWEEN 90000 AND 100000;
```

### Tuple Comparison
- SQL also supports tuple comparison, where multiple columns are compared in a single condition.

```sql
SELECT name, course_id
FROM instructor, teaches
WHERE (instructor.ID, dept_name) = (teaches.ID, 'Biology');
```

## In Clause Operator
- The **in** operator allows you to specify multiple values in a **where** clause
- The **in** operator is a shorthand for multiple **or** conditions
    ```sql
    select name
    from instructor
    where dept_name in ('Comp. Sci.', 'Biology')

## Duplicates
- In relations with duplicates, SQL can define how many copies of tuples appear in the result
- **Multiset** versions of some of the relational algebra operators given multiset relations r1 and 12:
    1. σθ(r1): If there are c₁ copies of tuple t₁ in r₁, and t₁ satisfies selections σθ, then there are c₁ copies of t₁ in ge(r1)
    2. Пд(r): For each copy of tuple t₁ in r₁, there is a copy of tuple ПA(t₁) in NA(1) where ΠA(t1) denotes the projection of the single tuple t₁
    3. r1 x r2: If there are c₁ copies of tuple t₁ in r₁ and c₂ copies of tuple t2 in 12, there are C1 X C2 copies of the tuple t1.t2 in 1 x 12
- Example: Suppose multiset relations r₁(A, B) and r2(C) are as follows: r₁ = {(1,a)(2,a)} r2 = {(2), (3), (3)}
- Then Πg(r1) would be {(a), (a)}, while Пg (1) x r₂ would be {(a, 2), (a, 2), (a, 3), (a, 3), (a, 3), (a, 3)}
- SQL duplicate semantics:
    ```sql
    select A1, A2,..., An
    from 1, 2,..., m
    where P
    ```
    is equivalent to the multiset version of the expression:
        ΠΑ1, Α2,..., Απ (σρ(r1 × 12 ×... xrm))